[
  {
    "image": "https://icons.iconarchive.com/icons/bokehlicia/captiva/256/chat-bubble-icon.png",
    "title": "ChatWave",
    "tagline": "Connect. Chat. Share. Instantly.",
    "companyName": "WaveTech Ltd",
    "id": 1,
    "description": "ChatWave brings people closer with a fast, intuitive, and beautifully designed interface for real-time conversations. Whether you’re messaging one-on-one or in large groups, the app ensures smooth and secure communication across devices. Share text, images, and files without limits, and stay connected wherever you go.\n\nWith built-in cloud synchronization, ChatWave lets you access your chats from any device instantly. End-to-end encryption keeps your messages private, while AI-powered filters block spam and unsafe content. The adaptive theme system automatically adjusts for day and night, ensuring comfort and readability.\n\nYou can also create communities, organize discussions by topics, and personalize your experience with custom emojis and stickers. ChatWave isn’t just another messaging app—it’s your personal communication hub designed for speed, simplicity, and security.",
    "size": 48,
    "reviews": "154K",
    "ratingAvg": 4.5,
    "downloads": "1.2M",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 2400 },
      { "name": "4 star", "count": 4100 },
      { "name": "5 star", "count": 9400 }
    ]
  },
  {
    "image": "https://icons.iconarchive.com/icons/bokehlicia/captiva/256/preferences-desktop-accessibility-icon.png",
    "title": "FitTrack Pro",
    "tagline": "Your Fitness, Smarter Tracked.",
    "companyName": "HealthWorks Inc",
    "id": 2,
    "description": "FitTrack Pro helps you transform your health journey through intelligent tracking and deep insights. Whether you’re running, cycling, or lifting, it records every detail with precision. The app offers beautifully visualized stats and progress charts that keep you motivated every step of the way.\n\nWith AI-driven analytics, FitTrack Pro learns from your habits to provide personalized workout plans and nutrition advice. Its calorie counter and step tracker work seamlessly with wearables, while real-time feedback ensures your performance keeps improving. You’ll never miss a workout again with smart reminders that adapt to your schedule.\n\nThe social challenge system allows you to compete with friends, share milestones, and celebrate progress. FitTrack Pro turns everyday fitness tracking into a rewarding experience—keeping you informed, engaged, and inspired to reach your full potential.",
    "size": 62,
    "reviews": "89K",
    "ratingAvg": 4.3,
    "downloads": "1.0M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 2800 },
      { "name": "5 star", "count": 4500 }
    ]
  },
  {
    "image": "https://icons.iconarchive.com/icons/bokehlicia/captiva/256/logview-icon.png",
    "title": "TaskMate",
    "tagline": "Plan. Focus. Achieve Goals.",
    "companyName": "Productivity Hub",
    "id": 3,
    "description": "TaskMate is designed to bring clarity and focus to your daily life. Organize to-dos, manage projects, and break down big goals into smaller actionable steps. Its clean design and fluid navigation make productivity feel natural, not forced.\n\nYou can categorize tasks, set deadlines, and receive smart notifications that adapt to your priorities. TaskMate’s intelligent reminders help you stay on track without feeling overwhelmed. With cross-device syncing, your lists, notes, and progress follow you anywhere.\n\nThe app also supports collaborative planning, allowing teams or families to share goals and track completion in real-time. Whether you’re managing work, studies, or personal routines, TaskMate helps you make every day count—bringing order and motivation to your schedule.",
    "size": 35,
    "reviews": "123K",
    "ratingAvg": 4.6,
    "downloads": "0.8M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1100 },
      { "name": "4 star", "count": 3400 },
      { "name": "5 star", "count": 7000 }
    ]
  },
  {
    "image": "https://icons.iconarchive.com/icons/bokehlicia/captiva/256/multimedia-photo-manager-icon.png",
    "title": "PhotoCraft",
    "tagline": "Create. Edit. Inspire Everyday.",
    "companyName": "VisionSoft",
    "id": 4,
    "description": "PhotoCraft turns ordinary photos into works of art with professional-grade editing tools that anyone can use. From AI filters to advanced color grading, it’s designed to bring your creativity to life without needing complex software.\n\nYou can adjust lighting, remove backgrounds, and apply cinematic effects with a single tap. The smart enhancement engine detects imperfections and fixes them automatically, giving your images a polished and natural finish. Batch editing lets you transform multiple photos effortlessly.\n\nWith integrated sharing features, PhotoCraft makes it easy to publish your creations on social media or cloud storage. Whether you’re a casual user or a digital artist, this app provides everything you need to express your vision beautifully and easily.",
    "size": 92,
    "reviews": "276K",
    "ratingAvg": 4.8,
    "downloads": "2.4M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 18300 }
    ]
  },
  {
    "image": "https://icons.iconarchive.com/icons/bokehlicia/captiva/256/inkscape-icon.png",
    "title": "TravelGo",
    "tagline": "Your World, One App.",
    "companyName": "Journey Labs",
    "id": 5,
    "description": "TravelGo is your ultimate travel companion, built to simplify trip planning from start to finish. Search destinations, compare flight deals, and build your itinerary all in one intuitive interface. It helps you save time, money, and stress before every journey.\n\nDiscover handpicked activities, restaurants, and attractions personalized to your interests. The app integrates live maps, offline navigation, and currency converters for seamless travel experiences. You can even track weather updates and receive safety alerts in real time.\n\nWith its smart itinerary organizer, TravelGo keeps your flights, hotels, and bookings neatly arranged. From local getaways to global adventures, it’s designed to make traveling smarter, smoother, and more enjoyable for everyone.",
    "size": 70,
    "reviews": "99K",
    "ratingAvg": 4.2,
    "downloads": "1.3M",
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 2300 },
      { "name": "4 star", "count": 3100 },
      { "name": "5 star", "count": 3800 }
    ]
  },
  {
    "image": "https://icons.iconarchive.com/icons/bokehlicia/captiva/256/cheese-icon.png",
    "title": "Foodify",
    "tagline": "Eat Smart, Live Better.",
    "companyName": "Tasty Corp",
    "id": 6,
    "description": "Foodify combines delicious recipes, smart nutrition tracking, and local delivery into a single intelligent food platform. Discover meals tailored to your dietary goals and cooking style. Every recipe is crafted by chefs and reviewed by nutrition experts.\n\nYou can log calories, track macros, and monitor your progress toward fitness or health targets. The built-in recommendation system learns your tastes over time and curates personalized meal plans to fit your lifestyle. Whether you’re vegan, keto, or just curious, Foodify adapts to your preferences.\n\nWith seamless delivery integration, you can order groceries or full meals from your favorite restaurants. Foodify isn’t just about food—it’s about building better eating habits, one meal at a time.",
    "size": 58,
    "reviews": "147K",
    "ratingAvg": 4.4,
    "downloads": "1.7M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 7600 }
    ]
  },
  {
    "image": "https://icons.iconarchive.com/icons/bokehlicia/captiva/256/vocal-icon.png",
    "title": "SoundSpace",
    "tagline": "Feel the Music Flow.",
    "companyName": "AudioNova",
    "id": 7,
    "description": "SoundSpace is built for true music lovers who crave quality, depth, and discovery. With millions of songs, albums, and podcasts at your fingertips, it creates an immersive experience that feels alive. The sleek design and smooth navigation make exploring music effortless.\n\nYou can create playlists, follow your favorite artists, and discover hidden gems through AI-powered recommendations. The app’s adaptive equalizer automatically tunes playback to your device, delivering crisp highs and deep bass for every track. Offline mode ensures your music travels with you anywhere.\n\nWhether you’re chilling, working, or working out, SoundSpace tailors your soundtrack to the moment. It’s more than a streaming service—it’s a space where sound meets emotion, and every beat tells your story.",
    "size": 85,
    "reviews": "640K",
    "ratingAvg": 4.7,
    "downloads": "9.5M",
    "ratings": [
      { "name": "1 star", "count": 1200 },
      { "name": "2 star", "count": 1700 },
      { "name": "3 star", "count": 4200 },
      { "name": "4 star", "count": 13000 },
      { "name": "5 star", "count": 43900 }
    ]
  },
  {
    "image": "https://icons.iconarchive.com/icons/bokehlicia/captiva/256/libreoffice-writer-icon.png",
    "title": "EduVerse",
    "tagline": "Learn. Grow. Succeed.",
    "companyName": "BrightMind",
    "id": 8,
    "description": "EduVerse redefines online learning by combining expert-led video lessons with hands-on practice. Explore thousands of courses in technology, business, art, and more—all taught by professionals passionate about sharing knowledge. The platform makes learning interactive and flexible for all skill levels.\n\nWith real-time progress tracking, personalized recommendations, and certification paths, EduVerse helps you stay consistent and confident. Each lesson is designed with bite-sized modules so you can learn at your own pace, anywhere, anytime. Discussion forums and peer challenges keep motivation high.\n\nWhether you’re upskilling for a job, starting a new hobby, or exploring career transitions, EduVerse empowers you to take charge of your growth. It’s your digital classroom for lifelong learning and self-improvement.",
    "size": 64,
    "reviews": "205K",
    "ratingAvg": 4.6,
    "downloads": "2.1M",
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1100 },
      { "name": "3 star", "count": 2300 },
      { "name": "4 star", "count": 5200 },
      { "name": "5 star", "count": 11100 }
    ]
  },
  {
    "image": "https://icons.iconarchive.com/icons/bokehlicia/captiva/256/accessories-text-editor-icon.png",
    "title": "NoteEase",
    "tagline": "Notes Made Simple.",
    "companyName": "Simplify Tools",
    "id": 9,
    "description": "NoteEase lets you capture ideas in seconds with an ultra-lightweight and minimal design. Whether you’re taking class notes, writing quick reminders, or brainstorming your next project, it helps you stay focused and organized. Sync your notes instantly across all your devices.\n\nYou can categorize notes with tags, color-code them for easy recognition, and even add attachments or voice memos. The search system finds anything in seconds, while autosave ensures nothing gets lost. Dark mode and clean typography make writing comfortable for long sessions.\n\nWith cloud backup and offline access, NoteEase is perfect for productivity on the go. It’s not just about storing text—it’s about creating clarity, keeping thoughts alive, and simplifying how you think and work.",
    "size": 27,
    "reviews": "74K",
    "ratingAvg": 4.1,
    "downloads": "0.6M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 1700 },
      { "name": "4 star", "count": 2200 },
      { "name": "5 star", "count": 2100 }
    ]
  },
  {
    "image": "https://icons.iconarchive.com/icons/bokehlicia/captiva/256/terminal-green-icon.png",
    "title": "FinancePro",
    "tagline": "Control Your Finances Easily.",
    "companyName": "SmartMoney Inc",
    "id": 10,
    "description": "FinancePro helps you take control of your money with ease and clarity. Track expenses, set budgets, and analyze your income sources all in one place. The intuitive dashboard gives you a clear picture of where your money goes every month.\n\nSmart categorization automatically sorts your transactions, while custom alerts remind you of bills and spending limits. Visual graphs and reports make it simple to understand your financial trends and plan smarter decisions. The app also syncs with multiple bank accounts securely.\n\nFinancePro isn’t just about managing money—it’s about building habits that lead to financial freedom. Whether you’re saving for a goal, paying off debt, or optimizing investments, this app gives you the tools to take charge confidently.",
    "size": 56,
    "reviews": "182K",
    "ratingAvg": 4.3,
    "downloads": "1.5M",
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 1900 },
      { "name": "4 star", "count": 5200 },
      { "name": "5 star", "count": 9300 }
    ]
  },
  {
    "image": "https://icons.iconarchive.com/icons/bokehlicia/captiva/256/browser-web-icon.png",
    "title": "Weatherly",
    "tagline": "Forecasts You Can Trust.",
    "companyName": "CloudWorks",
    "id": 11,
    "description": "Weatherly delivers accurate forecasts and real-time updates to help you plan your day confidently. From temperature and humidity to air quality and UV index, it keeps you informed about everything that matters. The interface is clean, visual, and easy to use for everyone.\n\nRadar maps and live storm tracking give you instant awareness of changing conditions. Get personalized notifications for severe weather alerts and adapt faster to rain, heat, or snow. The hourly forecast view ensures you’re never caught off guard when outdoors.\n\nWeatherly’s data comes from reliable global sources, offering precision wherever you are. Whether you’re traveling or staying local, you’ll always have a clear picture of the skies ahead with this dependable companion.",
    "size": 49,
    "reviews": "134K",
    "ratingAvg": 4.0,
    "downloads": "0.9M",
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 2600 },
      { "name": "4 star", "count": 3700 },
      { "name": "5 star", "count": 4900 }
    ]
  },
  {
    "image": "https://icons.iconarchive.com/icons/bokehlicia/captiva/256/preferences-system-power-icon.png",
    "title": "ZenSleep",
    "tagline": "Sleep Better, Live Better.",
    "companyName": "CalmWave Labs",
    "id": 12,
    "description": "ZenSleep helps you unwind, relax, and drift into deep sleep naturally. With soothing soundscapes, guided meditations, and breathing exercises, it creates the perfect bedtime atmosphere. The minimalist interface encourages mindfulness and calm before rest.\n\nThe built-in sleep tracker monitors your patterns, providing detailed insights into sleep cycles and quality. AI-based recommendations suggest habits and routines that gradually improve restfulness and energy levels. You can set bedtime reminders and gentle wake alarms with calming tones.\n\nWhether you’re struggling with stress or just want better rest, ZenSleep helps you create healthier nighttime habits. It’s your pocket-sized wellness companion designed to restore balance, calm, and peaceful nights.",
    "size": 44,
    "reviews": "95K",
    "ratingAvg": 4.5,
    "downloads": "0.8M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 2700 },
      { "name": "5 star", "count": 6900 }
    ]
  }
]
